src/cf/src/Reports/ДеньгиПоСтанкам/ДеньгиПоСтанкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ДеньгиПоСтанкам</name>
</mdclass:Report>

src/cf/src/Documents/ОбслуживаниеСтанка/ОбслуживаниеСтанка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОбслуживаниеСтанка</name>
  <registerRecords>InformationRegister.ЗагрузкаСтанков</registerRecords>
  <attributes>
    <name>Станок</name>
    <type>
      <types>CatalogRef.ПроизводственноеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбслуживания</name>
    <type>
      <types>EnumRef.ВидыОбслуживанияСтанков</types>
    </type>
  </attributes>
  <attributes>
    <name>Плановое</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Начало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Окончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Причина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Затраты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

src/cf/src/Reports/ДеньгиПоСтанкам/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Данные отчёта «Деньги по станкам» одной таблицей - внешний набор «Деньги» схемы. Строки - требования, завершённые в
// периоде (ЗагрузкаСтанков.ЗавершенныеТребования: выручка без НДС по цене строки заказа в основной валюте,
// себестоимость материалов, часы и их стоимость, кг), и фактические обслуживания, закончившиеся в периоде, с затратами:
// они уменьшают маржу станка, по заказам не распределяются (ответ владельца 2026-10-08). Отчёт и тест зовут эту
// функцию одинаково.
//
// Параметры:
//  Период - СтандартныйПериод - период отчёта
//  Момент - Дата, Неопределено - момент расчёта; Неопределено - текущая дата сеанса
//
// Возвращаемое значение:
//  Структура:
//   * Деньги         - ТаблицаЗначений - колонки полей набора схемы
//   * Предупреждение - Строка - позиции без веса и требования без строки заказа, пустая - всё посчитано
//
Функция ДанныеОтчета(Период, Момент = Неопределено) Экспорт

	Границы = ЗагрузкаСтанков.ГраницыПериодаОтчета(Период);
	Завершенные = ЗагрузкаСтанков.ЗавершенныеТребования(Границы.Начало, Границы.Окончание, Момент);
	Деньги = НоваяТаблицаДанных();
	Для Каждого Требование Из Завершенные.Требования Цикл
		Строка = Деньги.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Требование, "Станок, Заказ, Продукция, Характеристика, Выпущено, Выручка, Материалы,
			|Часы, СтоимостьЧасов, Кг");
		Строка.Документ = Требование.Требование;
	КонецЦикла;
	Выборка = ОбслуживанияСЗатратами(Границы.Начало, Границы.Окончание).Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Деньги.Добавить(), Выборка);
	КонецЦикла;
	Возврат Новый Структура("Деньги, Предупреждение", Деньги, Завершенные.Предупреждение);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбслуживанияСЗатратами(Начало, Окончание)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Обслуживание.Станок КАК Станок,
	|	Обслуживание.Ссылка КАК Документ,
	|	Обслуживание.Затраты КАК ЗатратыОбслуживания
	|ИЗ
	|	Документ.ОбслуживаниеСтанка КАК Обслуживание
	|ГДЕ
	|	Обслуживание.Проведен
	|	И НЕ Обслуживание.Плановое
	|	И Обслуживание.Затраты <> 0
	|	И Обслуживание.Окончание >= &Начало
	|	И Обслуживание.Окончание < &Окончание";
	Запрос.УстановитьПараметр("Начало", Начало);
	Запрос.УстановитьПараметр("Окончание", Окончание);
	Возврат Запрос.Выполнить();

КонецФункции

Функция НоваяТаблицаДанных()

	ТипЧисла = Новый ОписаниеТипов("Число");
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Станок", Новый ОписаниеТипов("СправочникСсылка.ПроизводственноеОборудование"));
	Таблица.Колонки.Добавить("Заказ", Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя"));
	Таблица.Колонки.Добавить("Продукция", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Таблица.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	Таблица.Колонки.Добавить("Документ", Новый ОписаниеТипов("ДокументСсылка.ТребованиеНакладная, ДокументСсылка.ОбслуживаниеСтанка"));
	Для Каждого Имя Из СтрРазделить("Выпущено,Выручка,Материалы,Часы,СтоимостьЧасов,ЗатратыОбслуживания,Кг", ",") Цикл
		Таблица.Колонки.Добавить(Имя, ТипЧисла);
	КонецЦикла;
	Возврат Таблица;

КонецФункции

#КонецОбласти
